{
    "version": "https://jsonfeed.org/version/1",
    "title": "BJFrank Photography",
    "description": "",
    "home_page_url": "https://Burk-Frank.github.io/BJF-Photo",
    "feed_url": "https://Burk-Frank.github.io/BJF-Photo/feed.json",
    "user_comment": "",
    "icon": "https://Burk-Frank.github.io/BJF-Photo/media/website/BJF-Logo-White-small.png",
    "author": {
        "name": "Burk Frank"
    },
    "items": [
        {
            "id": "https://Burk-Frank.github.io/BJF-Photo/ruby-and-me-part-1.html",
            "url": "https://Burk-Frank.github.io/BJF-Photo/ruby-and-me-part-1.html",
            "title": "Ruby &amp; Me - Part 1",
            "summary": "The featured image for today’s blog post is called ‘3 Sisters’. It is a photo I took of our three dogs a couple of years ago, but one of my favorites. The dogs are, from left to right, Annie, Gail and Ruby. On July 16,&hellip;",
            "content_html": "<div>\n<div>The featured image for today’s blog post is called ‘3 Sisters’. It is a photo I took of our three dogs a couple of years ago, but one of my favorites. The dogs are, from left to right, Annie, Gail and Ruby. On July 16, we had to say ‘good-bye’, until we meet again to Ruby, our eldest dog. I will surely miss you. I thought I would celebrate her life by writing about three specific times that were special between Ruby and myself.</div>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://Burk-Frank.github.io/BJF-Photo/media/posts/12/3-Sisters_1000x600.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://Burk-Frank.github.io/BJF-Photo/media/posts/12/responsive/3-Sisters_1000x600-xs.jpg 300w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/12/responsive/3-Sisters_1000x600-sm.jpg 480w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/12/responsive/3-Sisters_1000x600-md.jpg 768w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/12/responsive/3-Sisters_1000x600-lg.jpg 1024w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/12/responsive/3-Sisters_1000x600-xl.jpg 1360w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/12/responsive/3-Sisters_1000x600-2xl.jpg 1600w\"  alt=\"Three Sisters\" width=\"1000\" height=\"600\"></figure>\n<div>It was around the middle of June, 14 years ago, when I first met Ruby. I had my second total knee replacement on Monday, and now it was Saturday. I was still pretty sore and had trouble getting around, but my wife had told me about a miniature Aussie that was up for adoption and we needed to act fast if we were interested. So, we ended up meeting on a neutral spot so that we could see this dog and the breeders could evaluate how compatible we would be with her. Ruby had already been adopted once before, but she was returned because the older couple who had adopted her could not take on a dog with her enthusiasm and playfulness. She needed more attention than they could give her.</div>\n<br>\n<div>Ruby cautiously approached both Nancy and I. She gave us the once over sniff test, then sniffed me again. I probably had retained some of the odors of my hospital stay on me, but I must have been okay. After we decided that we would like to take this puppy home with us, we opened the car door and she hopped right in. She was already house broken and she seemed to like her new home right away.</div>\n<br>\n<div>On Monday, Nancy went to work and I began part of my rehab at home. I was to put my leg in a CPM machine that would continually bend my knee so that I would be able to regain my mobility after the surgery. I had to do this for three hours in the morning and three hours in the afternoon everyday for two weeks. As I strapped my leg into the CPM machine as I laid in bed, Ruby jumped up on the bed and decided to keep me company. She would lay there with me for all three hours as I had my leg strapped into that machine.</div>\n<br>\n<div>After finishing my morning routine I used my walker to go out to the kitchen, retrieve my lunch from the refrigerator and plop myself on the living room sofa so I could eat my lunch. Ruby would then lay on the rug next to the sofa and keep me company. I do think that getting some small portion of my lunch might have helped motivate her in staying with me. When I returned to the bedroom and strapped my leg back into the CPM machine in the afternoon, there was Ruby laying there next to me. This routine was how we spent our first two weeks together.</div>\n<br>\n<div>This was the beginning of a great friendship, two best buddies. This was the time that we bonded together, and I will never forget it. She kept me company and helped make my time in that CPM machine move along much faster.</div>\n</div>",
            "author": {
                "name": "Burk Frank"
            },
            "tags": [
                   "Exeter"
            ],
            "date_published": "2020-09-24T20:51:00-07:00",
            "date_modified": "2020-09-24T20:51:00-07:00"
        },
        {
            "id": "https://Burk-Frank.github.io/BJF-Photo/90-days-with-linux.html",
            "url": "https://Burk-Frank.github.io/BJF-Photo/90-days-with-linux.html",
            "title": "90 Days with Linux",
            "summary": "After celebrating the new year I decided to migrate my Windows 10 computers over to Linux. I had blogged about this ealier. I tried various distributions and different desktops. I finally decided to install Ubuntu with the gnome desktop on my production machine. I spent&hellip;",
            "content_html": "<p class=\"western\" align=\"left\">After celebrating the new year I decided to migrate my Windows 10 computers over to Linux. I had blogged about this ealier. I tried various distributions and different desktops. I finally decided to install Ubuntu with the gnome desktop on my production machine. I spent the first two weeks learning the basic in-n-outs of Linux. Initially, I was apprehensive about switching my wife’s computer over to Linux, and I let her make that decision. As it turned out, my wife likes the simplicity of Linux and the fact that it just works. As I look back on this migration these items come to mind -</p>\n<p class=\"western\" align=\"left\">Pros</p>\n<ul>\n<li class=\"western\">NO more patch Tuesdays! I can't believed how relieved I am over this. Updating Linux is fast and efficient</li>\n<li class=\"western\">Our wireless HP laserjet printer NO longer looses its connection to my wife's computer</li>\n<li class=\"western\">I have become more productive, no more having to fix things that Microsoft has broken in their updates</li>\n<li class=\"western\">Computers have once again become fun. There is a satisfaction in knowing that you can look forward to trying something new without it breaking your operating system. I am talking to you, Windows 10!</li>\n</ul>\n<p>Cons</p>\n<ul>\n<li class=\"western\">Everything isn’t perfect. There is a learning curve with any new operating system and Linux is no different. It takes some time and effort to learn how Linux operates, but I can attest that it is worth it. For me, I found it to be much more logical than Windows 10.</li>\n<li class=\"western\">RTFM – read the frickin’ manual. You need to understand that you may need to look things up in the manual.</li>\n<li class=\"western\">This isn’t really a con, but you need to realize that Google and Reddit are your friends. If you run into a problem the Linux community is more than happy to help you.</li>\n</ul>\n<p>The only thing is I wished I wouldn't have been so apprehensive and made the change much earlier. In this case - Change is GOOD!</p>",
            "author": {
                "name": "Burk Frank"
            },
            "tags": [
                   "Windows 10",
                   "Linux"
            ],
            "date_published": "2020-09-24T20:51:00-07:00",
            "date_modified": "2020-09-24T20:51:00-07:00"
        },
        {
            "id": "https://Burk-Frank.github.io/BJF-Photo/staying-home.html",
            "url": "https://Burk-Frank.github.io/BJF-Photo/staying-home.html",
            "title": "Staying Home",
            "summary": "As of today, March 25, there are 17 confirmed cases of COVID-19 in Tulare county. Tulare county is located in the south-central San Joaquin Valley in California. Both Nancy and I are following the CDC guidelines - Since we are retired, we have been able&hellip;",
            "content_html": "<p class=\"western\" align=\"left\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">As of today, March 25, there are 17 confirmed cases of </span></span><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">COVID-19 in Tulare county. Tulare county is located in the south-central San Joaquin Valley in California. Both Nancy and I are following the CDC guidelines -</span></span></span></p>\n<ul>\n<li class=\"western\"><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Staying at home</span></span></span></li>\n<li class=\"western\"><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Traveling only if it is essential</span></span></span></li>\n<li class=\"western\"><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Washing hands quite often</span></span></span></li>\n<li class=\"western\"><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Cleaning and disinfecting frequently touched surfaces</span></span></span></li>\n<li class=\"western\"><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Keeping my social distance on my daily walk</span></span></span></li>\n</ul>\n<p class=\"western\" align=\"left\"><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Since we are retired, we have been able to maintain this routine without changing our normal schedule too much. Nancy still walks the dogs, plays with the dogs, trains the dogs and is able to keep up with her yoga since her teacher is posting lessons online for her students.</span></span></span></p>\n<p class=\"western\" align=\"left\"><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">As for myself, I have kept to my normal routine with only a couple of slight changes. I usually read the news while eating my breakfast. I take my daily walk around the neighborhood keeping my social distance, and after returning work on my project for the day. Amazon had Fire HD 8 tablets on special last week, and I purchased one for both Nancy and myself. Once they arrived, my project was to work on those and set them up. That occupied a couple of afternoons. There is always something unplanned that seems to creep up on you, and today, the battery in our Toyota 4Runner died. So, my project for today was purchasing and replacing the battery in the 4Runner. I also roasted two batches of coffee this afternoon. One thing I have learned about retirement is that there is always something that can be worked on.</span></span></span></p>\n<p class=\"western\" align=\"left\"><span style=\"color: #2b2b2b;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Yes, both of us and our three dogs are doing well.</span></span></span></p>\n<p align=\"left\"> </p>",
            "author": {
                "name": "Burk Frank"
            },
            "tags": [
                   "Exeter"
            ],
            "date_published": "2020-09-24T20:51:00-07:00",
            "date_modified": "2020-09-24T20:51:00-07:00"
        },
        {
            "id": "https://Burk-Frank.github.io/BJF-Photo/migrating-to-linux.html",
            "url": "https://Burk-Frank.github.io/BJF-Photo/migrating-to-linux.html",
            "title": "Migrating to Linux",
            "summary": "This past January I decided to make the switch from Windows 10 to Linux. This was not an easy decision to make, but one I felt I had to make. My reasons for migrating to Linux as my daily operating system are: I am now&hellip;",
            "content_html": "<p class=\"western\" align=\"left\"><span style=\"font-size: large;\">This past January I decided to make the switch from Windows 10 to Linux. This was not an easy decision to make, but one I felt I had to make. My reasons for migrating to Linux as my daily operating system are:</span></p>\n<ul>\n<li class=\"western\"><span style=\"font-size: large;\">security, or should I say the lack of it. Windows 10 is so insecure that they have to push huge monthly updates to patch a myriad of security vulnerabilities.</span></li>\n<li class=\"western\"><span style=\"font-size: large;\">telemetry and lack of privacy. Microsoft has hidden and made it almost impossible to turn off all of their telemetry. Most major operating systems give you the option to turn this off, but not Microsoft. I believe that I own the rights to my own data, not Microsoft. Microsoft does not need to know everything that I am doing on my computer.</span></li>\n<li class=\"western\"><span style=\"font-size: large;\">updates. On the second Tuesday of every month Microsoft releases patches to cover security vulnerabilities, operating system bugs and sometimes add new features. Sounds great, except that these patches usually introduce their own bugs. Some users have discovered that their computers will not boot after being patched while others have found that it has deleted some files stored on their desktop. Sloppy updates seem to be Microsoft’s forte.</span></li>\n</ul>\n<figure class=\"post__image\"><span style=\"font-size: large;\"><img loading=\"lazy\"  src=\"https://Burk-Frank.github.io/BJF-Photo/media/posts/9/windows10-linux_800x450.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://Burk-Frank.github.io/BJF-Photo/media/posts/9/responsive/windows10-linux_800x450-xs.jpg 300w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/9/responsive/windows10-linux_800x450-sm.jpg 480w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/9/responsive/windows10-linux_800x450-md.jpg 768w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/9/responsive/windows10-linux_800x450-lg.jpg 1024w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/9/responsive/windows10-linux_800x450-xl.jpg 1360w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/9/responsive/windows10-linux_800x450-2xl.jpg 1600w\"  alt=\"NO Windows 10\" width=\"800\" height=\"450\"></figure>The main reason I stayed with Windows 10 so long was some of the programs I use were on Windows 10 but not on Linux. I have been a regular user of Microsoft Office and Adobe Photoshop and Lightroom. I have found an open source replacement for MS Office and am in the process of evaluating different open source programs to replace the Adobe products.</span></p>\n<p class=\"western\" align=\"left\"><span style=\"font-size: large;\">I am now into my third month of using Linux almost exclusively and I realize that I should have made the switch from Windows 10 to Linux much earlier.</span></p>",
            "author": {
                "name": "Burk Frank"
            },
            "tags": [
                   "Windows 10",
                   "Linux"
            ],
            "date_published": "2020-09-24T20:51:00-07:00",
            "date_modified": "2020-09-24T20:51:00-07:00"
        },
        {
            "id": "https://Burk-Frank.github.io/BJF-Photo/the-process.html",
            "url": "https://Burk-Frank.github.io/BJF-Photo/the-process.html",
            "title": "The Process",
            "summary": "In my previous post I looked at various options to create a static website and I decided to use an app/program called Publii. This is the process that I follow in creating and updating my static website. One advantage of creating a website on your&hellip;",
            "content_html": "<p align=\"left\"><span style=\"font-size: large;\">In my </span><span style=\"font-size: large;\">previous</span><span style=\"font-size: large;\"> post I looked at various options </span><span style=\"font-size: large;\">to</span><span style=\"font-size: large;\"> creat</span><span style=\"font-size: large;\">e</span><span style=\"font-size: large;\"> a static website and I decided to use an app/program called Publii. This is the process that I follow in creating </span><span style=\"font-size: large;\">and updating my</span><span style=\"font-size: large;\"> static website.</span></p>\n<p align=\"left\"><span style=\"font-size: large;\">One advantage of creating a website </span><span style=\"font-size: large;\">on your local computer</span><span style=\"font-size: large;\"> is you can easily control all facets of developing that website. </span><span style=\"font-size: large;\">You can preview your work as you go and</span><span style=\"font-size: large;\"> decide when it is ready to deploy on the World Wide Web. </span></p>\n<p align=\"left\"><span style=\"font-size: large;\">There are a number of ways to deploy a website. You can use a hosting service like GoDaddy, HostGator </span><span style=\"font-size: large;\">or any other hosting service</span><span style=\"font-size: large;\">. T</span><span style=\"font-size: large;\">hey </span><span style=\"font-size: large;\">usually </span><span style=\"font-size: large;\">offer all in one packages to host your website. The advantage with this approach is they do almost all of the work </span><span style=\"font-size: large;\">for you</span><span style=\"font-size: large;\">, but you do pay for that convenience. For someone who wants to create a personal blog those yearly fees can be pricey. </span></p>\n<p align=\"left\"><span style=\"font-size: large;\">I have taken a different route to deploy my website. </span><span style=\"font-size: large;\">After</span><span style=\"font-size: large;\"> I have finished working in Publii, I sync my website to my github pages. Githu</span><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">b </span></span><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">is a site that </span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">provides hosting for software development. </span></span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Github repositories </span></span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">can </span></span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">house</span></span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\"> web pages, projects, </span></span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">software code, etc. Storing your software project on Github is free and </span></span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">your work is </span></span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">open to the public to view or use. </span></span></span></p>\n<p align=\"left\"><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">The Actual web hosting site I use is Netlify. Netlify has a free hosting plan for those who use Github and are working with static websites. When I make changes to my site, I sync them to Github and Netlify is triggered to automatically update my website on the World Wide Web. </span></span></span></p>\n<p align=\"left\"><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">By going this route to deploy my website the cost is very minimal. </span></span></span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">The only cost is renewing my domain registry every year and that is around $10.00. There is more work setting this up in the beginning, but you can see it does pay off.</span></span></span></p>\n<p align=\"left\"><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: large;\">Now, all I have to do is update my website in Publii, sync it to Github and it will be deployed on the World Wide Web within a few minutes. This can be done quite easily.</span></span></span></p>",
            "author": {
                "name": "Burk Frank"
            },
            "tags": [
                   "Website"
            ],
            "date_published": "2020-09-24T20:51:00-07:00",
            "date_modified": "2020-09-24T20:51:00-07:00"
        },
        {
            "id": "https://Burk-Frank.github.io/BJF-Photo/static-site-generators.html",
            "url": "https://Burk-Frank.github.io/BJF-Photo/static-site-generators.html",
            "title": "Static Site Generators",
            "summary": "In my previous post I stated that I was going to convert my website from WordPress, a dynamic site builder, to a static site builder. This process has been more work than I originally thought it would be. I have looked at various ways to&hellip;",
            "content_html": "<p class=\"western\" align=\"left\"><span style=\"font-size: large;\">In my previous post I stated that I was going to convert my website from WordPress, a dynamic site builder, to a static site builder. This process has been more work than I originally thought it would be. I have looked at various ways to create a static website. Some of these are:</span></p>\n<ul>\n<li class=\"western\"><span style=\"font-size: large;\">a static website generator. There are a number of static site generators and I decided to try Hugo. After playing with Hugo for a while, I decided it wasn’t for me. It is a very good program for creating static websites, but most of the work has to be done through a terminal program. Being a photographer and a visual learner, I decided that this wasn’t for me.</span></li>\n<li class=\"western\"><span style=\"font-size: large;\">WordPress. Yes, you can create a static site in WordPress. After you have created/worked on your site you need to use a plugin that will create the static site to upload to your hosting service. I like using WordPress, because it has a graphical interface. I even began to create this site on WordPress. As I continued working I realized that this whole process would be too cumbersome to use. I would become disinterested in updating and adding to my website in the future. Therefore, this was not a viable solution.</span></li>\n<li class=\"western\"><span style=\"font-size: large;\">Publii. I stumbled across this one evening while continuing to research other ways to create a static website. Publii is an app/program you install on your computer and use to create a static website. It has a graphical interface similar to WordPress. Moving from WordPress to Publii is quite easy. The main downside is that there are only a few themes to choose from.</span></li>\n</ul>\n<p class=\"western\" align=\"left\"><span style=\"font-size: large;\">In my next post, I will walk you through the process that I use to publish this website on the World Wide Web.</span></p>\n<p class=\"western\" align=\"left\"> </p>",
            "author": {
                "name": "Burk Frank"
            },
            "tags": [
                   "Website"
            ],
            "date_published": "2020-09-24T20:51:00-07:00",
            "date_modified": "2020-09-24T20:51:00-07:00"
        },
        {
            "id": "https://Burk-Frank.github.io/BJF-Photo/wordpress-to-static-site.html",
            "url": "https://Burk-Frank.github.io/BJF-Photo/wordpress-to-static-site.html",
            "title": "WordPress to Static Site",
            "summary": "Wow! As you can probably tell, I have decided to change my website. My website has been converted to a static website. The previous version was a dynamic website powered by WordPress. Changing over to a static website has allowed me the opportunity to start&hellip;",
            "content_html": "<!-- wp:paragraph -->\n<p>Wow! As you can probably tell, I have decided to change my website. My website has been converted to a static website. The previous version was a dynamic website powered by WordPress. Changing over to a static website has allowed me the opportunity to start my website all over again from scratch, which I have done. There are a number of reasons why I decided to use a static website.</p>\n<!-- /wp:paragraph --><!-- wp:paragraph -->\n<p>My previous website was a dynamic website and it was probably overkill for a small website like mine. Dynamic sites usually use a database to change the information that is displayed on each web page. For example, a site like Facebook is a dynamic website. The page that a user sees when logging in to Facebook is specific to that person. Images and text that are displayed varies from one user to another. On a static website the web page displayed is the same for everyone who visits the site.</p>\n<!-- /wp:paragraph --><!-- wp:paragraph -->\n<p>If I still continued to host my personal blog on WordPress, I would have to:</p>\n<!-- /wp:paragraph --><!-- wp:group -->\n<div class=\"wp-block-group\">\n<div class=\"wp-block-group__inner-container\"><!-- wp:list -->\n<ul>\n<li>pay for a decent web host. Web hosting can get expensive.</li>\n<li>pay for SSL certs. Many web hosting sites force you to pay extra for this.</li>\n<li>maintain and keep WordPress updated to the latest version. You do not want to get hacked.</li>\n<li>keep all of the plugins up to date. Plugins can be a security vulnerability. Websites are often hacked if plugins are not continually updated.</li>\n<li>do further work to improve the readability of my website.</li>\n</ul>\n<!-- /wp:list --></div>\n</div>\n<!-- /wp:group --><!-- wp:paragraph -->\n<p>This is my first attempt at creating a static website. I will be re-evaluating this whole process as I go along. This website is literally, a work in progress.</p>\n<!-- /wp:paragraph -->",
            "author": {
                "name": "Burk Frank"
            },
            "tags": [
                   "Website"
            ],
            "date_published": "2020-09-24T20:51:00-07:00",
            "date_modified": "2020-09-24T20:51:00-07:00"
        },
        {
            "id": "https://Burk-Frank.github.io/BJF-Photo/reverend-nats.html",
            "url": "https://Burk-Frank.github.io/BJF-Photo/reverend-nats.html",
            "title": "Reverend Nat&#x27;s",
            "summary": "Both Nancy and I enjoy visiting Portland, Oregon. In December, just before Christmas, we took a non-stop flight from Fresno to Portland. It was a mid-morning flight and arrived in Portland in the early afternoon. Since we have visited Portland before, we knew that there&hellip;",
            "content_html": "<!-- wp:paragraph -->\n<p>Both Nancy and I enjoy visiting Portland, Oregon. In December, just before Christmas, we took a non-stop flight from Fresno to Portland. It was a mid-morning flight and arrived in Portland in the early afternoon. Since we have visited Portland before, we knew that there was no reason to rent a car. You can go almost anywhere in Portland using their public transportation system, the Tri-Met. We usually stay in a hotel outside of the downtown area and use the Tri-Met to travel between our hotel and the downtown area.</p>\n<!-- /wp:paragraph -->\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://Burk-Frank.github.io/BJF-Photo/media/posts/1/Rev_Nat_1000x600.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://Burk-Frank.github.io/BJF-Photo/media/posts/1/responsive/Rev_Nat_1000x600-xs.jpg 300w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/1/responsive/Rev_Nat_1000x600-sm.jpg 480w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/1/responsive/Rev_Nat_1000x600-md.jpg 768w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/1/responsive/Rev_Nat_1000x600-lg.jpg 1024w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/1/responsive/Rev_Nat_1000x600-xl.jpg 1360w ,https://Burk-Frank.github.io/BJF-Photo/media/posts/1/responsive/Rev_Nat_1000x600-2xl.jpg 1600w\"  alt=\"Reverend Nat's\" width=\"1000\" height=\"600\"></figure>One of our favorite activities while in Portland is to shop at all the different sporting goods stores. Columbia has their flagship store in Portland and we usually vacation in Portland when they are having their end of season sale, but not this year. It is the holiday season and very little was on sale. Mountain Hardware, The North Face, Patagonia and REI all have stores in Portland. We ended up spending at least one day of our vacation going window shopping. We added some items to our Christmas list, hoping Santa would know that we had been good most of the year.</p>\n<!-- wp:paragraph --><!-- /wp:paragraph --><!-- wp:paragraph -->\n<p>Portland is also known for their craft beer breweries. Some of the best craft beers that we have tasted were from the Portland area. We also enjoy having a meal at some of these brewpubs. Since I am gluten intolerant, I no longer drink beer unless it is gluten-free. Instead, I have developed a taste for hard cider and Portland is known for their hard cider houses. One of my favorites is Reverend Nat’s and I sure enjoy just sitting down and enjoying a glass of good hard apple cider. The photo on this blog post was taken at Reverend Nat’s.</p>\n<!-- /wp:paragraph --><!-- wp:paragraph -->\n<p>Our trip to Portland was very enjoyable. We usually visit Portland in the summer, but this time we chose the early winter. The weather was nice, not too cold and not too rainy. It was good to get away, even if it was just for a couple of days.</p>\n<!-- /wp:paragraph -->",
            "author": {
                "name": "Burk Frank"
            },
            "tags": [
                   "Vacation"
            ],
            "date_published": "2020-09-24T20:51:00-07:00",
            "date_modified": "2020-09-24T20:51:00-07:00"
        }
    ]
}
